#include"dllmain.h"

void 跟随遍历()
{
	ULONG64 人物指针 = 读长整数(基址::人物基址B);
	ULONG64 首部指针 = 读长整数(读长整数(人物指针 + 基址::地图偏移2) + 基址::地图开始2);
	ULONG64 尾部指针 = 读长整数(读长整数(人物指针 + 基址::地图偏移2) + 基址::地图结束2);
	ULONG64 遍历数量 = (尾部指针 - 首部指针) / 24;
	for (size_t i = 0; i < 遍历数量; i++)
	{
		ULONG64 遍历指针 = 读长整数(读长整数(首部指针 + i * 24) + 16) - 48;
		int 遍历类型 = 读整数型(遍历指针 + 基址::类型偏移);
		int 遍历阵营 = 读整数型(遍历指针 + 基址::阵营偏移);
		ULONG64 怪物血量 = 读长整数(遍历指针 + 基址::怪物血量);
		if (遍历类型 == 529 || 遍历类型 == 273 || 遍历类型 == 545)
		{
			if (遍历阵营 != 0)
			{
				if (人物指针 != 遍历指针)
				{
					坐标Call(人物指针, 取坐标Call(遍历指针, 0), 取坐标Call(遍历指针, 1), 取坐标Call(遍历指针, 2));
				}
				if (怪物血量 > 0)
				{
					keybd_event(88, MapVirtualKey(88, 0), 0, 0);//按下
					Sleep(1);
					keybd_event(88, MapVirtualKey(88, 0), KEYEVENTF_KEYUP, 0);//松开
					自动循环变量 = false;
				}
			}
		}
	}
}

void 跟随BOSS()
{
	ULONG64 人物指针 = 读长整数(基址::人物基址B);
	ULONG64 首部指针 = 读长整数(读长整数(人物指针 + 基址::地图偏移2) + 基址::地图开始2);
	ULONG64 尾部指针 = 读长整数(读长整数(人物指针 + 基址::地图偏移2) + 基址::地图结束2);
	ULONG64 遍历数量 = (尾部指针 - 首部指针) / 24;
	for (size_t i = 0; i < 遍历数量; i++)
	{
		ULONG64 遍历指针 = 读长整数(读长整数(首部指针 + i * 24) + 16) - 48;
		int 遍历类型 = 读整数型(遍历指针 + 基址::类型偏移);
		int 遍历阵营 = 读整数型(遍历指针 + 基址::阵营偏移);
		ULONG64 怪物血量 = 读长整数(遍历指针 + 基址::怪物血量);
		wstring 怪物名称 = (wchar_t*)*(INT64*)(遍历指针 + 基址::名称偏移);
		if (遍历类型 == 529 || 遍历类型 == 273 || 遍历类型 == 545)
		{
			if (寻找文本(怪物名称, L"领主") != -1)
			{
				坐标Call(人物指针, 取坐标Call(遍历指针, 0), 取坐标Call(遍历指针, 1), 取坐标Call(遍历指针, 2));
				if (怪物血量 > 0)
				{
					keybd_event(88, MapVirtualKey(88, 0), 0, 0);//按下
					keybd_event(88, MapVirtualKey(88, 0), KEYEVENTF_KEYUP, 0);//松开
					自动循环变量 = false;
				}
			}
			
		}
	}
}