#include"dllmain.h"

static int 未央图内计次 = 0;

void 处理事件()
{
	MSG msg;
	while (PeekMessage(&msg, NULL, 0, 0, PM_REMOVE))
	{
		if (msg.message == WM_QUIT)
		{
			// 如果收到WM_QUIT消息，退出循环
			break;
		}
		TranslateMessage(&msg);
		DispatchMessage(&msg);
	}
}

// 超级延时函数
void 超级延时(int msec)
{
	LARGE_INTEGER dueTime;
	dueTime.QuadPart = -10 * (LONGLONG)msec * 1000;  // -10 * 毫秒 * 1000 微秒/毫秒

	HANDLE hTimer = CreateWaitableTimerA(NULL, FALSE, NULL);
	if (hTimer == NULL)
	{
		std::cerr << "无法创建定时器: " << GetLastError() << std::endl;
		return;
	}

	if (!SetWaitableTimer(hTimer, &dueTime, 0, NULL, NULL, FALSE))
	{
		std::cerr << "无法设置定时器: " << GetLastError() << std::endl;
		CloseHandle(hTimer);
		return;
	}

	// 等待定时器触发或消息到达
	while (MsgWaitForMultipleObjects(1, &hTimer, FALSE, INFINITE, QS_ALLINPUT) != WAIT_OBJECT_0)
	{
		处理事件();
	}

	CloseHandle(hTimer);
}

void 虚拟热键()
{
	INPUT esc[2] = {};

	// 按下 ESC 键
	esc[0].type = INPUT_KEYBOARD;
	esc[0].ki.wVk = 27;  // ESC 键的虚拟键码
	esc[0].ki.dwFlags = 0;

	// 释放 ESC 键
	esc[1].type = INPUT_KEYBOARD;
	esc[1].ki.wVk = 27;
	esc[1].ki.dwFlags = KEYEVENTF_KEYUP;

	// 发送输入
	SendInput(2, esc, sizeof(INPUT));

	INPUT Spaces[2] = {};

	// 按下 ESC 键
	Spaces[0].type = INPUT_KEYBOARD;
	Spaces[0].ki.wVk = 32;  // ESC 键的虚拟键码
	Spaces[0].ki.dwFlags = 0;

	// 释放 ESC 键
	Spaces[1].type = INPUT_KEYBOARD;
	Spaces[1].ki.wVk = 32;
	Spaces[1].ki.dwFlags = KEYEVENTF_KEYUP;

	// 发送输入
	SendInput(2, Spaces, sizeof(INPUT));

}

void 图内数据处理()
{
	if (读配置(L"刷图模式", L"剧情升级") != 1 && 读配置(L"刷图模式", L"未央爬楼") == 1 && 读配置(L"刷图模式", L"活动升级") != 1)
	{
		未央图内处理数据();
	}
	if (读配置(L"刷图模式", L"剧情升级") == 1 && 读配置(L"刷图模式", L"未央爬楼") != 1 && 读配置(L"刷图模式", L"活动升级") != 1)
	{
		剧情图内处理数据();
	}
	if (读配置(L"刷图模式", L"剧情升级") != 1 && 读配置(L"刷图模式", L"未央爬楼") != 1 && 读配置(L"刷图模式", L"活动升级") == 1)
	{
		活动图内处理数据();
	}
}

void 未央图内处理数据()
{
	未央图内计次++;
	if (未央图内计次 == 2)
	{
		未央图内计次 = 0;
		/* -------------------------------------------------------未央爬楼图内处理-------------------------------------------------*/

		if (是否在BOSS房())
		{
			if (BOSS死亡())
			{
				if (是否有物品() == false)
				{
					if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
					{
						组包回城();
					}
					if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
					{
						回城Call(2);
					}
				}
				else
				{
					if (读配置(L"装备获取", L"获取装备") == 1)
					{
						拾取遍历();
					}
					else
					{
						if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
						{
							组包回城();
						}
						if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
						{
							回城Call(2);
						}
					}
				}
			}
			else
			{
				跟随BOSS();
			}

		}
		else
		{

			if (是否开门())
			{
				if (是否有物品() == false)
				{
					if (读配置(L"图内处理", L"未央全图") == 1)
					{
						if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
						{
							int 地图反馈 = 未央全图();
							组包强顺(地图反馈);
						}
						if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
						{
							int 地图反馈 = 未央全图();
							过图Call(地图反馈);
						}
					}
					else
					{
						if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
						{
							组包强顺(顺图方向());
						}
						if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
						{
							过图Call(顺图方向());
						}
					}
				}
				else
				{
					if (读配置(L"装备获取", L"获取装备") == 1)
					{
						拾取遍历();
					}
					else
					{
						if (读配置(L"图内处理", L"未央全图") == 1)
						{
							if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
							{
								int 地图反馈 = 未央全图();
								组包强顺(地图反馈);
							}
							if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
							{
								int 地图反馈 = 未央全图();
								过图Call(地图反馈);
							}
						}
						else
						{
							if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
							{
								组包强顺(顺图方向());
							}
							if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
							{
								过图Call(顺图方向());
							}
						}
					}
				}

			}
			else
			{
				跟随遍历();
			}
		}
	}
}

void 剧情图内处理数据()
{
	选图次数 = 0;
	/* --------------------------------------------------  剧情升级图内处理-----------------------------------------------------*/
	if (是否在BOSS房())
	{
		if (BOSS死亡())
		{
			if (读配置(L"图内处理", L"获取翻牌") == 1)
			{
				翻牌Call();

				if (是否有物品() == false)
				{
					if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
					{
						组包回城();
					}
					if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
					{
						回城Call(2);
					}
				}
				else
				{
					if (读配置(L"装备获取", L"获取装备") == 1)
					{
						拾取遍历();
					}
					else
					{
						if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
						{
							组包回城();
						}
						if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
						{
							回城Call(2);
						}
					}
				}
			}
			else
			{
				if (是否有物品() == false)
				{
					if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
					{
						组包回城();
					}
					if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
					{
						回城Call(2);
					}
				}
				else
				{
					if (读配置(L"装备获取", L"获取装备") == 1)
					{
						拾取遍历();
					}
					else
					{
						if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
						{
							组包回城();
						}
						if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
						{
							回城Call(2);
						}
					}
				}
			}
		}
		if (!Pack.BOSS死亡)
		{
			跟随BOSS();
		}
	}
	else
	{
		if (是否开门())
		{
			if (是否有物品())
			{
				if (读配置(L"装备获取", L"获取装备") == 1)
				{
					拾取遍历();
				}
				else
				{
					if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
					{
						组包强顺(顺图方向());
					}
					if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
					{
						过图Call(顺图方向());
					}
				}
			}
			else
			{
				if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
				{
					组包强顺(顺图方向());
				}
				if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
				{
					过图Call(顺图方向());
				}
			}

		}
		else
		{
			跟随遍历();
		}
	}
}

void 活动图内处理数据()
{
	/* -------------------------------------------------------活动升级图内处理-------------------------------------------------*/

	if (是否在BOSS房())
	{
		if (BOSS死亡())
		{
			if (读配置(L"图内处理", L"获取翻牌") == 1)
			{
				翻牌Call();
				if (Pack.翻牌奖励)
				{
					if (是否有物品() == false)
					{
						if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
						{
							组包回城();
						}
						if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
						{
							回城Call(2);
						}
					}
					else
					{
						if (读配置(L"装备获取", L"获取装备") == 1)
						{
							拾取遍历();
						}
						else
						{
							if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
							{
								组包回城();
							}
							if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
							{
								回城Call(2);
							}
						}
					}
				}
			}
		}
		else
		{
			跟随BOSS();
		}

	}
	else
	{
		if (是否开门())
		{
			if (是否有物品())
			{
				if (读配置(L"装备获取", L"获取装备") == 1)
				{
					拾取遍历();
				}
				else
				{
					活动角色过图();
				}
			}
			else
			{
				活动角色过图();
			}

		}
		else
		{
			跟随遍历();
		}
	}

}

void 活动角色过图()
{
	if (取角色等级() != 108)
	{
		if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
		{
			组包强顺(顺图方向());
		}
		if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
		{
			过图Call(顺图方向());
		}
	}
	else
	{
		if (Pack.当前坐标.x == 0 && Pack.当前坐标.y == 2)
		{
			过图Call(1);
		}
		if (Pack.当前坐标.x == 1 && Pack.当前坐标.y == 2)
		{
			过图Call(1);
		}
		if (Pack.当前坐标.x == 2 && Pack.当前坐标.y == 2)
		{
			过图Call(1);
		}
		if (Pack.当前坐标.x == 3 && Pack.当前坐标.y == 2)
		{
			过图Call(2);
		}
		if (Pack.当前坐标.x == 3 && Pack.当前坐标.y == 1)
		{
			过图Call(2);
		}
		if (Pack.当前坐标.x == 3 && Pack.当前坐标.y == 0)
		{
			过图Call(0);
		}
		if (Pack.当前坐标.x == 2 && Pack.当前坐标.y == 0)
		{
			过图Call(0);
		}
		if (Pack.当前坐标.x == 1 && Pack.当前坐标.y == 0)
		{
			过图Call(3);
		}
		if (Pack.当前坐标.x == 1 && Pack.当前坐标.y == 1)
		{
			过图Call(1);
		}
	}
}