#include"dllmain.h"

void 未央图内处理数据()
{

	/* -------------------------------------------------------未央爬楼图内处理-------------------------------------------------*/

	if (是否在BOSS房())
	{
		if (BOSS死亡())
		{
			if (是否有物品() == false)
			{
				if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
				{
					组包回城();
				}
				if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
				{
					全局.回城 = 1;
				}
			}
			else
			{
				if (读配置(L"装备获取", L"获取装备") == 1)
				{
					Sleep(500);
					全局.拾取 = 1;
				}
				else
				{
					if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
					{
						组包回城();
					}
					if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
					{
						全局.回城 = 1;
					}
				}
			}
		}
		else
		{
			全局.跟随 = 2;
		}

	}
	else
	{

		if (是否开门())
		{
			if (判断未央柱子() == false)
			{
				if (是否有物品() == false)
				{
					if (寻找文本(Pack.地图名称, L"试炼") != -1)
					{
						全局.过图 = 2;
					}
					if (读配置(L"图内处理", L"未央全图") == 1)
					{
						全局.过图 = 3;
					}
					else//判断未央全图为假
					{
						全局.过图 = 1;
					}
				}
				else//判断是否有物品为真
				{
					if (读配置(L"装备获取", L"获取装备") == 1)
					{
						Sleep(500);
						全局.拾取 = 1;
					}
					else//判断拾取装备为假
					{
						if (读配置(L"图内处理", L"未央全图") == 1)
						{
							全局.过图 = 3;
						}
						else//判断未央全图为假
						{
							全局.过图 = 1;
						}
					}
				}
			}
		}
		else
		{
			if (判断未央柱子() == false)
			{
				全局.跟随 = 1;
			}
		}
	}
}

void 剧情图内处理数据()
{
	选图次数 = 0;
	/* --------------------------------------------------  剧情升级图内处理-----------------------------------------------------*/
	if (是否在BOSS房())
	{
		if (BOSS死亡())
		{
			if (读配置(L"图内处理", L"获取翻牌") == 1)
			{
				全局.翻牌 = 1;

				if (是否有物品() == false)
				{
					if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
					{
						组包回城();
					}
					if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
					{
						全局.回城 = 1;
					}
				}
				else
				{
					if (读配置(L"装备获取", L"获取装备") == 1)
					{
						Sleep(500);
						全局.拾取 = 1;
					}
					else
					{
						if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
						{
							组包回城();
						}
						if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
						{
							全局.回城 = 1;
						}
					}
				}
			}
			else
			{
				if (是否有物品() == false)
				{
					if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
					{
						组包回城();
					}
					if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
					{
						全局.回城 = 1;
					}
				}
				else
				{
					if (读配置(L"装备获取", L"获取装备") == 1)
					{
						Sleep(500);
						全局.拾取 = 1;
					}
					else
					{
						if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
						{
							组包回城();
						}
						if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
						{
							全局.回城 = 1;
						}
					}
				}
			}
		}
		else
		{
			全局.跟随 = 2;
		}
	}
	else
	{
		if (是否开门())
		{
			if (是否有物品())
			{
				if (读配置(L"装备获取", L"获取装备") == 1)
				{
					Sleep(500);
					全局.拾取 = 1;
				}
				else
				{
					if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
					{
						组包强顺(顺图方向());
					}
					if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
					{
						全局.过图 = 1;
					}
				}
			}
			else
			{
				if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
				{
					组包强顺(顺图方向());
				}
				if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
				{
					全局.过图 = 1;
				}
			}

		}
		else
		{
			全局.跟随 = 1;
		}
	}
}

void 活动图内处理数据()
{
	/* -------------------------------------------------------活动升级图内处理-------------------------------------------------*/

	if (是否在BOSS房())
	{
		if (BOSS死亡())
		{
			if (读配置(L"图内处理", L"获取翻牌") == 1)
			{
				全局.翻牌 = 1;
				if (Pack.翻牌奖励)
				{
					if (是否有物品() == false)
					{
						if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
						{
							组包回城();
						}
						if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
						{
							全局.回城 = 1;
						}
					}
					else
					{
						if (读配置(L"装备获取", L"获取装备") == 1)
						{
							Sleep(500);
							全局.拾取 = 1;
						}
						else
						{
							if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
							{
								组包回城();
							}
							if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
							{
								全局.回城 = 1;
							}
						}
					}
				}
			}
		}
		else
		{
			全局.跟随 = 2;
		}

	}
	else
	{
		if (是否开门())
		{
			if (是否有物品())
			{
				if (读配置(L"装备获取", L"获取装备") == 1)
				{
					Sleep(500);
					全局.拾取 = 1;
				}
				else
				{
					活动角色过图();
				}
			}
			else
			{
				活动角色过图();
			}

		}
		else
		{
			全局.跟随 = 1;
		}
	}

}

void 活动角色过图()
{
	if (取角色等级() != 108)
	{
		if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
		{
			组包强顺(顺图方向());
		}
		if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
		{
			全局.过图 = 1;
		}
	}
	else
	{
		if (Pack.当前坐标.x == 0 && Pack.当前坐标.y == 2)
		{
			组包强顺(1);
		}
		if (Pack.当前坐标.x == 1 && Pack.当前坐标.y == 2)
		{
			组包强顺(1);
		}
		if (Pack.当前坐标.x == 2 && Pack.当前坐标.y == 2)
		{
			组包强顺(1);
		}
		if (Pack.当前坐标.x == 3 && Pack.当前坐标.y == 2)
		{
			组包强顺(2);
		}
		if (Pack.当前坐标.x == 3 && Pack.当前坐标.y == 1)
		{
			组包强顺(2);
		}
		if (Pack.当前坐标.x == 3 && Pack.当前坐标.y == 0)
		{
			组包强顺(0);
		}
		if (Pack.当前坐标.x == 2 && Pack.当前坐标.y == 0)
		{
			组包强顺(0);
		}
		if (Pack.当前坐标.x == 1 && Pack.当前坐标.y == 0)
		{
			组包强顺(3);
		}
		if (Pack.当前坐标.x == 1 && Pack.当前坐标.y == 1)
		{
			组包强顺(1);
		}
	}
}

void 自用图内处理数据()
{
	选图次数 = 0;
	/* --------------------------------------------------  剧情升级图内处理-----------------------------------------------------*/
	if (是否在BOSS房())
	{
		if (BOSS死亡())
		{
			if (读配置(L"图内处理", L"获取翻牌") == 1)
			{
				全局.翻牌 = 1;

				if (是否有物品() == false)
				{
					if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
					{
						组包回城();
					}
					if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
					{
						全局.回城 = 1;
					}
				}
				else
				{
					if (读配置(L"装备获取", L"获取装备") == 1)
					{
						Sleep(500);
						全局.拾取 = 1;
					}
					else
					{
						if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
						{
							组包回城();
						}
						if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
						{
							全局.回城 = 1;
						}
					}
				}
			}
			else
			{
				if (是否有物品() == false)
				{
					if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
					{
						组包回城();
					}
					if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
					{
						全局.回城 = 1;
					}
				}
				else
				{
					if (读配置(L"装备获取", L"获取装备") == 1)
					{
						Sleep(500);
						全局.拾取 = 1;
					}
					else
					{
						if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
						{
							组包回城();
						}
						if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
						{
							全局.回城 = 1;
						}
					}
				}
			}
		}
		else
		{
			全局.跟随 = 2;
		}
	}
	else
	{
		if (是否开门())
		{
			if (是否有物品())
			{
				if (读配置(L"装备获取", L"获取装备") == 1)
				{
					Sleep(500);
					全局.拾取 = 1;
				}
				else
				{
					if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
					{
						组包强顺(顺图方向());
					}
					if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
					{
						全局.过图 = 1;
					}
				}
			}
			else
			{
				if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
				{
					组包强顺(顺图方向());
				}
				if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
				{
					全局.过图 = 1;
				}
			}

		}
		else
		{
			全局.跟随 = 1;
		}
	}
}
