#include"dllmain.h"

int 选图次数 = 0;

void  剧情选图处理()
{
	选图次数++;
	if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
	{
		if (选图次数 > 3)
		{
			选图次数 = 0;
			组包卡界面();
		}
		else
		{
			组包进图(Pack.地图编号, Pack.地图难度);
		}

	}
	if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
	{
		if (选图次数 > 3)
		{
			选图次数 = 0;
			组包卡界面();
		}
		else
		{
			全局.进图 = 1;
		}
	}
}

void 活动升级选图处理()
{
	if (读配置(L"操作模式", L"发包操作") == 1 && 读配置(L"操作模式", L"模拟操作") != 1)
	{
		组包进图(Pack.地图编号, 2);
	}
	if (读配置(L"操作模式", L"发包操作") != 1 && 读配置(L"操作模式", L"模拟操作") == 1)
	{
		全局.进图 = 2;
	}
}
